STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_aes.h
typedef struct hal_aes_handle_s hal_aes_handle_t; /*!< AES Handle type Definition */

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
/*! AES callback type definition */
typedef void (*hal_aes_cb_t)(hal_aes_handle_t *haes);
#endif /* USE_HAL_AES_REGISTER_CALLBACKS */

/*! AES handle Structure definition */
struct hal_aes_handle_s
{
  hal_aes_t                 instance;           /*!< AES Register base address, can be a value of @ref hal_aes_t */

  volatile  hal_aes_state_t global_state;       /*!< AES peripheral state, can be a value of @ref hal_aes_state_t */

  uint32_t                  algorithm;          /*!< AES chaining mode */

  volatile uint32_t         data_size_byte;     /*!< Length of input data in byte */

  volatile uint32_t         data_size_sum_byte; /*!< Sum of successive payloads lengths (in bytes), stored for a single
                                                     signature computation after several messages processing */

  const uint32_t            *p_in_buff;         /*!< Pointer to AES input processing buffer(plaintext or ciphertext) */

  uint32_t                  *p_out_buff;        /*!< Pointer to AES output processing buffer (Allowing to store
                                                     encrypted or decrypted text) */

  volatile uint32_t         block_count;        /*!< Counter of input data blocks, one block is equal to 128 bits */

#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
  const uint32_t            *p_header;          /*!< Used only in AES GCM and CCM Algorithm for authentication,
                                                     GCM: Also known as Additional Authentication Data
                                                     CCM: Named B1 composed of the associated data length and
                                                           Associated Data. */

  uint32_t                  header_size_byte ; /*!< The size of header buffer in bytes */
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */

#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
  volatile uint32_t         suspend_request;   /*!< AES peripheral suspension request flag */

  const uint32_t            *p_key;           /*!< Application pointer key to be stored in the handle during
                                                   suspension */
#endif /* USE_HAL_AES_SUSPEND_RESUME */

#if defined(USE_HAL_AES_DMA) && (USE_HAL_AES_DMA == 1)
  hal_dma_handle_t          *hdma_in;         /*!< AES In DMA handle parameters */
  hal_dma_handle_t          *hdma_out;        /*!< AES Out DMA handle parameters */
#endif /* USE_HAL_AES_DMA */

#if defined(USE_HAL_AES_USER_DATA) && (USE_HAL_AES_USER_DATA == 1)
  const void                *p_user_data;      /*!< User Data Pointer */
#endif /* (USE_HAL_AES_USER_DATA) */

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
  hal_aes_cb_t               p_in_cplt_cb;      /*!< AES Input FIFO transfer completed callback  */
  hal_aes_cb_t               p_out_cplt_cb;     /*!< AES Output FIFO transfer completed callback */
  hal_aes_cb_t               p_error_cb;        /*!< AES Error callback */
#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
  hal_aes_cb_t               p_suspend_cb;      /*!< AES Suspend callback */
#endif /* USE_HAL_AES_SUSPEND_RESUME */
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
  /* in case of single process at a time: one single variable storing the last errors */
  volatile uint32_t          last_error_codes;  /*!< AES peripheral error code */
#endif /* USE_HAL_AES_GET_LAST_ERRORS */
};

/*! AES suspend resume Structure definition */
#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
/*! AES suspend resume configuration structure */
typedef struct
{
  uint32_t                  CR;                 /*!< Copy of AES control register when processing is suspended */

  uint32_t                  iv_buff[4];         /*!< Copy of Initialization Vector registers */

#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
  uint32_t                  SUSPxR[8];        /*!< Copy of suspension registers, used only in AES GCM and CCM
                                                   algorithms */
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */

  hal_aes_t                 instance;           /*!< AES Register base address, can be a value of @ref hal_aes_t */

  volatile  hal_aes_state_t previous_state;       /*!< AES peripheral state, can be a value of @ref hal_aes_state_t */

  uint32_t                  algorithm;          /*!< AES chaining mode */

  volatile uint32_t         data_size_byte;     /*!< Length of input data in byte */

  volatile uint32_t         data_size_sum_byte; /*!< Sum of successive payloads lengths (in bytes), stored for a single
                                                     signature computation after several messages processing */

  const uint32_t            *p_in_buff;         /*!< Pointer to AES input processing buffer(plaintext or ciphertext) */

  uint32_t                  *p_out_buff;        /*!< Pointer to AES output processing buffer (Allowing to store
                                                     encrypted or decrypted text) */

  volatile uint32_t         block_count;        /*!< Counter of input data blocks, one block is equal to 128 bits */

#if (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)) \
     || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
  const uint32_t            *p_header;          /*!< Used only in AES GCM and CCM Algorithm for authentication,
                                                     GCM: Also known as Additional Authentication Data
                                                     CCM: Named B1 composed of the associated data length and
                                                           Associated Data. */

  uint32_t                  header_size_byte ; /*!< The size of header buffer in bytes */
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */

#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
  volatile uint32_t         suspend_request;   /*!< AES peripheral suspension request flag */

