STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_aes.h
  const uint32_t            *p_key;           /*!< Application pointer key to be stored in the handle during
                                                   suspension */
#endif /* USE_HAL_AES_SUSPEND_RESUME */

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
  hal_aes_cb_t               p_in_cplt_cb;      /*!< AES Input FIFO transfer completed callback  */
  hal_aes_cb_t               p_out_cplt_cb;     /*!< AES Output FIFO transfer completed callback */
  hal_aes_cb_t               p_error_cb;        /*!< AES Error callback */
#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
  hal_aes_cb_t               p_suspend_cb;      /*!< AES Suspend callback */
#endif /* USE_HAL_AES_SUSPEND_RESUME */
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

} hal_aes_save_context_t;
#endif /* USE_HAL_AES_SUSPEND_RESUME */

/**
  * @}
  */

/* Exported functions ---------------------------------------------------------*/
/** @defgroup AES_Exported_Functions HAL AES Functions
  * @{
  */

/** @defgroup AES_Exported_Functions_Group1 Initialization and De-initialization functions
  * @{
  */
hal_status_t HAL_AES_Init(hal_aes_handle_t *haes, hal_aes_t instance);
void HAL_AES_DeInit(hal_aes_handle_t *haes);
/**
  * @}
  */

/** @defgroup AES_Exported_Functions_Group2 Configuration functions
  * @{
  */
#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
hal_status_t HAL_AES_ECB_SetConfig(hal_aes_handle_t *haes);
hal_status_t HAL_AES_CBC_SetConfig(hal_aes_handle_t *haes, const uint32_t *p_init_vect);
#endif /* USE_HAL_AES_ECB_CBC_ALGO */

#if defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1)
hal_status_t HAL_AES_CTR_SetConfig(hal_aes_handle_t *haes, const uint32_t *p_init_vect);
#endif /* USE_HAL_AES_CTR_ALGO */

#if defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)
hal_status_t HAL_AES_GCM_GMAC_SetConfig(hal_aes_handle_t *haes, const hal_aes_gcm_config_t *p_config);
#endif /* USE_HAL_AES_GCM_GMAC_ALGO */

#if defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1)
hal_status_t HAL_AES_CCM_SetConfig(hal_aes_handle_t *haes, const hal_aes_ccm_config_t *p_config);
#endif /* USE_HAL_AES_CCM_ALGO */

hal_status_t HAL_AES_SetNormalKey(hal_aes_handle_t *haes, hal_aes_key_size_t key_size, const uint32_t *p_key);

hal_status_t HAL_AES_SetSharedKey(hal_aes_handle_t *haes, hal_aes_key_size_t key_size);
#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
hal_status_t HAL_AES_SetHWKey(hal_aes_handle_t *haes, hal_aes_key_size_t key_size, hal_aes_key_select_t key_select,
                              hal_aes_key_mode_t key_mode);
hal_status_t HAL_AES_EnableKeyProtection(hal_aes_handle_t *haes);
hal_status_t HAL_AES_DisableKeyProtection(hal_aes_handle_t *haes);
hal_aes_key_protection_status_t HAL_AES_IsEnabledKeyProtection(const hal_aes_handle_t *haes);
#endif /* USE_HAL_AES_ECB_CBC_ALGO */

hal_status_t HAL_AES_SetDataSwapping(hal_aes_handle_t *haes, hal_aes_data_swapping_t data_swapping);
hal_aes_data_swapping_t HAL_AES_GetDataSwapping(const hal_aes_handle_t *haes);
/**
  * @}
  */

/** @defgroup AES_Exported_Functions_Group3 Process functions
  * @{
  */
/* encryption/decryption */
hal_status_t HAL_AES_Encrypt(hal_aes_handle_t *haes, const void *p_input, uint16_t size_byte, void *p_output,
                             uint32_t timeout_ms);
hal_status_t HAL_AES_Decrypt(hal_aes_handle_t *haes, const void *p_input, uint16_t size_byte, void *p_output,
                             uint32_t timeout_ms);
hal_status_t HAL_AES_Encrypt_IT(hal_aes_handle_t *haes, const void *p_input, uint16_t size_byte, void *p_output);
hal_status_t HAL_AES_Decrypt_IT(hal_aes_handle_t *haes, const void *p_input, uint16_t size_byte, void *p_output);
#if defined(USE_HAL_AES_DMA) && (USE_HAL_AES_DMA == 1)
hal_status_t HAL_AES_Encrypt_DMA(hal_aes_handle_t *haes, const void *p_input, uint16_t size_byte, void *p_output);
hal_status_t HAL_AES_Decrypt_DMA(hal_aes_handle_t *haes, const void *p_input, uint16_t size_byte, void *p_output);
#endif /* USE_HAL_AES_DMA */

#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
hal_status_t HAL_AES_RequestSuspend(hal_aes_handle_t *haes);
hal_status_t HAL_AES_SaveContext(hal_aes_handle_t *haes, hal_aes_save_context_t *p_context);
hal_status_t HAL_AES_RestoreContext(hal_aes_handle_t *haes, const hal_aes_save_context_t *p_context);
hal_status_t HAL_AES_Resume(hal_aes_handle_t *haes);
#endif /* defined (USE_HAL_AES_SUSPEND_RESUME) */
/**
  * @}
  */

/** @defgroup AES_Exported_Functions_Group4 IRQHandler,Callbacks and , Link DMA functions
  * @{
  */
void HAL_AES_IRQHandler(hal_aes_handle_t *haes);

void HAL_AES_InCpltCallback(hal_aes_handle_t *haes);
void HAL_AES_OutCpltCallback(hal_aes_handle_t *haes);
void HAL_AES_ErrorCallback(hal_aes_handle_t *haes);
#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
void HAL_AES_SuspendCallback(hal_aes_handle_t *haes);
#endif /* defined (USE_HAL_AES_SUSPEND_RESUME) */

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
hal_status_t HAL_AES_RegisterInTransferCpltCallback(hal_aes_handle_t *haes, hal_aes_cb_t p_callback);
hal_status_t HAL_AES_RegisterOutTransferCpltCallback(hal_aes_handle_t *haes, hal_aes_cb_t p_callback);
hal_status_t HAL_AES_RegisterErrorCallback(hal_aes_handle_t *haes, hal_aes_cb_t p_callback);
#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
hal_status_t HAL_AES_RegisterSuspendCallback(hal_aes_handle_t *haes, hal_aes_cb_t p_callback);
#endif /* defined (USE_HAL_AES_SUSPEND_RESUME) */
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

#if defined(USE_HAL_AES_DMA) && (USE_HAL_AES_DMA == 1)
hal_status_t HAL_AES_SetInDMA(hal_aes_handle_t *haes, hal_dma_handle_t *hdma_in);
hal_status_t HAL_AES_SetOutDMA(hal_aes_handle_t *haes, hal_dma_handle_t *hdma_out);
#endif /* USE_HAL_AES_DMA */
/**
  * @}
  */

/** @defgroup AES_Exported_Functions_Group5 Peripheral State, Error and Get last IV functions
  * @{
  */
hal_aes_state_t HAL_AES_GetState(const hal_aes_handle_t *haes);
#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
uint32_t HAL_AES_GetLastErrorCodes(const hal_aes_handle_t *haes);
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

#if defined(USE_HAL_AES_USER_DATA) && (USE_HAL_AES_USER_DATA == 1)
void HAL_AES_SetUserData(hal_aes_handle_t *haes, const void *p_user_data);
const void *HAL_AES_GetUserData(const hal_aes_handle_t *haes);
#endif /* (USE_HAL_AES_USER_DATA) */
#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
hal_status_t HAL_AES_CBC_GetLastOutputIV(const hal_aes_handle_t *haes, const uint8_t *p_last_iv, uint8_t last_iv_size);
#endif /* USE_HAL_AES_ECB_CBC_ALGO*/
#if (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
hal_status_t HAL_AES_CTR_GetLastOutputIV(const hal_aes_handle_t *haes, const uint8_t *p_last_iv, uint8_t last_iv_size);
#endif /*USE_HAL_AES_CTR_ALGO */
/**
  * @}
  */

/** @defgroup AES_Exported_Functions_Group6 Tag Generating functions
  * @{
  */

#if defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)
hal_status_t HAL_AES_GCM_GenerateAuthTAG(hal_aes_handle_t *haes, uint32_t *p_auth_tag, uint32_t timeout_ms);
#endif /* (USE_HAL_AES_GCM_GMAC_ALGO) */

#if defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1)
hal_status_t HAL_AES_CCM_GenerateAuthTAG(hal_aes_handle_t *haes, uint32_t *p_auth_tag, uint32_t timeout_ms);
#endif /* (USE_HAL_AES_CCM_ALGO) */

/**
  * @}
  */

#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
/** @defgroup AES_Exported_Functions_Group7 AES Processing Key functions
  * @{
  */
/* Wrap and Unwrap key functions */
hal_status_t HAL_AES_WrapKey(hal_aes_handle_t *haes, const uint32_t *p_key_in, hal_aes_key_size_t key_size,
                             uint32_t *p_key_output, uint32_t timeout_ms);

hal_status_t HAL_AES_UnwrapKey(hal_aes_handle_t *haes, const uint32_t *p_key_in, hal_aes_key_size_t key_size,
                               uint32_t timeout_ms);
/* Encrypt and Decrypt Shared key functions */
hal_status_t HAL_AES_EncryptSharedKey(hal_aes_handle_t *haes, const uint32_t *p_key_in, hal_aes_key_size_t key_size,
                                      uint32_t *p_key_output, uint32_t target_id, uint32_t timeout_ms);
hal_status_t HAL_AES_DecryptSharedKey(hal_aes_handle_t *haes, const uint32_t *p_key_in, hal_aes_key_size_t key_size,
                                      uint32_t target_id, uint32_t timeout_ms);
/**
  * @}
  */
#endif /* USE_HAL_AES_ECB_CBC_ALGO */

/** @defgroup AES_Exported_Functions_Group8 Static Inlines functions
  * @{
This section provides functions allowing to manage AES interrupts and flags:
  - HAL_AES_GetFlag()          :Allowing to return the state of a flag
  - HAL_AES_ClearFlagRDWRERR() :Allowing to clear the read/write error flag
  - HAL_AES_ClearFlagCC()      :Allowing to clear the computation complete flag
  - HAL_AES_ClearFlagKERR()    :Allowing to clear the invalid key error flag
  - HAL_AES_ClearFlagRNGERR()  :Allowing to clear the AES RNG error flag

