STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_aes.h
  - HAL_AES_GetITSource()      :Allowing to return the state of an interrupt
  - HAL_AES_EnableIT()         :Allowing to enable an AES interrupt
  - HAL_AES_DisableIT()        :Allowing to disable an AES interrupt
  */
/** @brief  Check whether the specified AES status flag is set or not.
  * @param  haes Specifies the AES handle
  * @param  flag Specifies the flag to check, this parameter can be one of the following values:
  *            @arg @ref HAL_AES_FLAG_KEYVALID Key valid flag
  *            @arg @ref HAL_AES_FLAG_BUSY GCM process suspension forbidden or transferring a shared key from SAES IP.
  *            @arg @ref HAL_AES_FLAG_WRERR Write Error flag
  *            @arg @ref HAL_AES_FLAG_RDERR Read Error flag
  *            @arg @ref HAL_AES_FLAG_CC Computation Complete flag
  *            @arg @ref HAL_AES_FLAG_KERR Key error flag
  *            @arg @ref HAL_AES_FLAG_RDWRERR Read/write Error flag
  *            @arg @ref HAL_AES_FLAG_RNGERR RNG Error flag

  * @retval uint32_t The state of flag (0 or 1).
  */

__STATIC_INLINE uint32_t HAL_AES_GetFlag(const hal_aes_handle_t *haes, uint32_t flag)
{
  uint32_t status;

  if ((flag == (uint32_t)HAL_AES_FLAG_KEYVALID) || (flag == (uint32_t)HAL_AES_FLAG_BUSY)
      || (flag == (uint32_t)HAL_AES_FLAG_WRERR) || (flag == (uint32_t)HAL_AES_FLAG_RDERR))
  {
    status = ((READ_BIT(((AES_TypeDef *)((uint32_t)haes->instance))->SR,
                        (flag & 0x7FFFFFFFU)) == (flag & 0x7FFFFFFFU)) ? 1U : 0U);
  }
  else if ((flag == (uint32_t)HAL_AES_FLAG_CC) || (flag == (uint32_t)HAL_AES_FLAG_KERR)
           || (flag == (uint32_t)HAL_AES_FLAG_RDWRERR) || (flag == (uint32_t)HAL_AES_FLAG_RNGERR))
  {
    status = ((READ_BIT(((AES_TypeDef *)((uint32_t)haes->instance))->ISR, flag) == flag) ? 1U : 0U);
  }
  else
  {
    status = 0;
  }
  return (status);
}

/** @brief  Clear the AES Read/write error flag.
  * @param  haes Specifies the AES handle
  */
__STATIC_INLINE void HAL_AES_ClearFlagRDWRERR(hal_aes_handle_t *haes)
{
  SET_BIT(((AES_TypeDef *)((uint32_t)haes->instance))->ICR, AES_ICR_RWEIF);
}

/** @brief  Clear the AES computation complete flag.
  * @param  haes Specifies the AES handle
  */
__STATIC_INLINE void HAL_AES_ClearFlagCC(hal_aes_handle_t *haes)
{
  SET_BIT(((AES_TypeDef *)((uint32_t)haes->instance))->ICR, AES_ICR_CCF);
}

/** @brief  Clear the AES invalid key error flag.
  * @param  haes Specifies the AES handle
  */
__STATIC_INLINE void HAL_AES_ClearFlagKERR(hal_aes_handle_t *haes)
{
  SET_BIT(((AES_TypeDef *)((uint32_t)haes->instance))->ICR, AES_ICR_KEIF);
}

#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
/** @brief  Clear the AES RNG error flag.
  * @param  haes Specifies the AES handle
  */
__STATIC_INLINE void HAL_AES_ClearFlagRNGERR(hal_aes_handle_t *haes)
{
  SET_BIT(((AES_TypeDef *)((uint32_t)haes->instance))->ICR, AES_ICR_RNGEIF);
}
#endif /* USE_HAL_AES_ECB_CBC_ALGO */

/** @brief  Check whether the specified AES interrupt source is enabled or not.
  * @param  haes      Specifies the AES handle
  * @param  interrupt AES interrupt source to check
  *         This parameter can be one of the following values:
  *            @arg @ref HAL_AES_IT_RDWRERR Error interrupt (used for RDERR and WRERR)
  *            @arg @ref HAL_AES_IT_CC Computation Complete interrupt
  *            @arg @ref HAL_AES_IT_KERR Key error interrupt
  *            @arg @ref HAL_AES_IT_RNGERR Rng error interrupt
  * @retval uint32_t State of interruption (0 or 1).
  */
__STATIC_INLINE uint32_t HAL_AES_GetITSource(const hal_aes_handle_t *haes, uint32_t interrupt)
{
  return ((READ_BIT(((AES_TypeDef *)((uint32_t)haes->instance))->IER, (uint32_t)interrupt)
           == (uint32_t)interrupt) ? 1U : 0U);
}

/**
  * @brief  Enable the AES interrupt.
  * @param  haes      Specifies the AES handle
  * @param  interrupt AES Interrupt
  *         This parameter can be a combination of the following values:
  *            @arg @ref HAL_AES_IT_RDWRERR Error interrupt (used for RDERR and WRERR)
  *            @arg @ref HAL_AES_IT_CC Computation Complete interrupt
  *            @arg @ref HAL_AES_IT_KERR Key error interrupt
  *            @arg @ref HAL_AES_IT_RNGERR RNG error interrupt
  */
__STATIC_INLINE void HAL_AES_EnableIT(hal_aes_handle_t *haes, uint32_t interrupt)
{
  SET_BIT(((AES_TypeDef *)((uint32_t)haes->instance))->IER, interrupt);
}

/**
  * @brief  Disable the AES interrupt.
  * @param  haes      Specifies the AES handle
  * @param  interrupt AES Interrupt
  *         This parameter can be a combination of the following values:
  *            @arg @ref HAL_AES_IT_RDWRERR Error interrupt (used for RDERR and WRERR)
  *            @arg @ref HAL_AES_IT_CC Computation Complete interrupt
  *            @arg @ref HAL_AES_IT_KERR Key error interrupt
  *            @arg @ref HAL_AES_IT_RNGERR RNG error interrupt
  */
__STATIC_INLINE void HAL_AES_DisableIT(hal_aes_handle_t *haes, uint32_t interrupt)
{
  CLEAR_BIT(((AES_TypeDef *)((uint32_t)haes->instance))->IER, interrupt);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* USE_HAL_AES_ECB_CBC_ALGO || USE_HAL_AES_CTR_ALGO || USE_HAL_AES_GCM_GMAC_ALGO || USE_HAL_AES_CCM_ALGO*/
#endif /* AES or SAES */
/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32U5XX_HAL_AES_H */
